# Required libraries

In [5]:
import mysql.connector
import pandas as pd

In [6]:
connection = mysql.connector.connect(host="localhost",
                                    user="root",
                                    passwd="8248176784sS@",
                                    database="E_Commerce")
cursorobject = connection.cursor()

Q1. Create tables for supplier, customer, category, product, 
productDetails, order, rating to store the data for the E-commerence

In [ ]:
table_creation_query=""" create table `supplier` (SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(15) ); 
                        
                       create table `customer`( CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID));
                        
                        CREATE TABLE `category` (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID));
                        
                        CREATE TABLE `product` (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID));
                        
                        CREATE TABLE `product_details` (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID));
                        
                        CREATE TABLE `orders` (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID));
                        
                        CREATE TABLE `rating` (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))
                        """
                  
cursorobject.execute(table_creation_query)

Q2. Insert the following data in the table

In [49]:
#insert into supplier table
insert_query= "Insert into supplier (SUPP_ID,SUPP_NAME,SUPP_CITY,SUPP_PHONE) values(%s,%s,%s,%s)"
VAL=[
(1 , "Rajesh Retail" , "Delhi" , "1234567890"),
(2 , "Appario Ltd." , "Mumbai" , "258963147032"),
(3 , "Knome products" ,  "Bangalore" , "9785462315"),
(4 , "Bansal Retails" , "Kochi" , "8975463285"),
(5 , "Mittal Ltd." , "Lucknow" , "7898456532")]

cursorobject.executemany(insert_query,VAL)
connection.commit()

In [50]:
# insert into "customer" table
insert_query= "Insert into customer (CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER) values(%s,%s,%s,%s,%s)"
VAL=[
(1 , "AAKASH" , "9999999999" , "DELHI" , "M"),
(2 , "AMAN" , "9785463215" , "NOIDA" , "M"),
(3 , "NEHA" , "9999999998" , "MUMBAI" , "F"),
(4 , "MEGHA" , "9994562399" , "KOLKATA" , "F"),
(5 , "PULKIT" , "7895999999" , "LUCKNOW" , "M")]

cursorobject.executemany(insert_query,VAL)
connection.commit()

In [52]:
# insert into "categoty" table
insert_query= "Insert into category (CAT_ID,CAT_NAME) values(%s,%s)"
VAL=[
(1 , "BOOKS"),
(2 , "GAMES"),
(3 , "GROCERIES"),
(4 , "ELECTRONICS"),
(5 , "CLOTHES")]

cursorobject.executemany(insert_query,VAL)
connection.commit()

In [53]:
# insert into "product" table

insert_query= "Insert into product (PRO_ID,PRO_NAME,PRO_DESC,CAT_ID) values(%s,%s,%s,%s)"
VAL=[
(1 , "GTA V" , "DFJDJFDJFDJFDJFJF" , 2),
(2 , "TSHIRT" , "DFDFJDFJDKFD" , 5),
(3 , "ROG LAPTOP" , "DFNTTNTNTERND" , 4),
(4 , "OATS" , "REURENTBTOTH" , 3 ),
(5 , "HARRY POTTER" , "NBEMCTHTJTH" , 1 )]

cursorobject.executemany(insert_query,VAL)
connection.commit()

In [54]:
# insert into "product_details" table

insert_query= "Insert into product_details (PROD_ID,PRO_ID,SUPP_ID,PROD_PRICE) values(%s,%s,%s,%s)"
VAL=[
(1 , 1 , 2 , 1500),
(2 , 3 , 5 , 30000),
(3 , 5 , 1 , 3000),
(4 , 2 , 3 , 2500 ),
(5 , 4 , 1 , 1000 )]

cursorobject.executemany(insert_query,VAL)
connection.commit()

In [63]:
# insert into "orders" table

insert_query= "Insert into orders (ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID) values(%s,%s,%s,%s,%s)"
VAL=[
(20 , 1500 , '2021-10-12' , 3 , 5),
(25 , 30500 ,'2021-09-16' , 5 , 2),
(26 , 2000 , '2021-10-05' , 1 , 1),
(30 , 3500 , '2021-08-16' , 4 , 3),
(50 , 2000 , '2021-10-06' , 2 , 1)]

cursorobject.executemany(insert_query,VAL)
connection.commit()

In [65]:
# insert into "rating" table

insert_query= "Insert into rating (RAT_ID,CUS_ID,SUPP_ID,RAT_RATSTARS) values(%s,%s,%s,%s)"
VAL=[
(1 , 2 , 2 , 4),
(2 , 3 , 4 , 3),
(3 , 5 , 1 , 5),
(4 , 1 , 3 , 2),
(5 , 4 , 5 , 4 )]

cursorobject.executemany(insert_query,VAL)
connection.commit()

Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [14]:
query= """ select c.CUS_GENDER,count(C.CUS_ID) From customer as c join
          (select CUS_ID from orders where ORD_AMOUNT>=3000) as q on c.CUS_ID=q.CUS_ID group by c.CUS_GENDER"""
cursorobject.execute(query)
output=cursorobject.fetchall()
output

[('M', 1), ('F', 1)]

Q4) Display all the order along with product name ordered by a customer having Customer_Id=2

In [22]:
query= """ select ORD_ID , PRO_NAME from orders , product_details , product where orders.CUS_ID=2 and orders.PROD_ID = product_details.PROD_ID AND product_details.PRO_ID= product.PRO_ID """
cursorobject.execute(query)
output=cursorobject.fetchall()
output_df=pd.DataFrame(output,columns=["ORD_ID","PROD_NAME"])
output_df

   ORD_ID PROD_NAME
0      50     GTA V

In [ ]:
Q5) Display the Supplier details who can supply more than one product.

In [24]:
query5 =""" select supplier.* from supplier, product_details
           where supplier.SUPP_ID in
           ( select product_details.SUPP_ID from product_details
             group by product_details.SUPP_ID having count(product_details.SUPP_ID)>1) 
              group by supplier.SUPP_ID"""
cursorobject.execute(query5)
output=cursorobject.fetchall()
output_df=pd.DataFrame(output,columns=["SUPP_ID","SUPP_NAME","SUPP_CITY","SUPP_PHONE"])
output_df

   SUPP_ID      SUPP_NAME SUPP_CITY  SUPP_PHONE
0        1  Rajesh Retail     Delhi  1234567890

Q6) Find the category of the product whose order amount is minimum

In [33]:
query6 = """ select category.* from `orders` inner join product_details on 
            `orders`.PROD_ID=product_details.PROD_ID inner join product on
            product.PRO_ID=PRODUCT_details.PRO_ID inner join category on
            category.CAT_ID=product.CAT_ID having min(`orders`.ORD_AMOUNT)"""
cursorobject.execute(query6)
output=cursorobject.fetchall()
output_df=pd.DataFrame(output,columns=["CAT_ID","CAT_NAME"])
output_df

   CAT_ID   CAT_NAME
0       3  GROCERIES

Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [45]:
query7=""" select product.PRO_ID, product.PRO_NAME   from product inner join product_details on
           product.PRO_ID=product_details.PRO_ID inner join `orders` on
           product_details.PROD_ID=`orders`.PROD_ID where `orders`.ORD_DATE>"2021-10-05"
          """
cursorobject.execute(query7)
output=cursorobject.fetchall()
output_df=pd.DataFrame(output,columns=["PRO_ID","PRO_NAME"])
output_df

   PRO_ID PRO_NAME
0       4     OATS
1       1    GTA V

Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating

In [51]:
query8=""" select supplier.SUPP_ID , supplier.SUPP_NAME,customer.CUS_ID,rating.RAT_RATSTARS
          from  rating inner join supplier on  rating.SUPP_ID=supplier.SUPP_ID
          inner join customer on rating.CUS_ID= customer.CUS_ID order by rating.RAT_RATSTARS desc limit 3  """
cursorobject.execute(query8)
output=cursorobject.fetchall()
output_df=pd.DataFrame(output,columns=["SUPP_ID","SUPP_NAME","CUS_ID","RAT_RATSTARS"])
output_df

   SUPP_ID      SUPP_NAME  CUS_ID  RAT_RATSTARS
0        1  Rajesh Retail       5             5
1        2   Appario Ltd.       2             4
2        5    Mittal Ltd.       4             4

Q9) Display customer name and gender whose names start or end with character 'A'

In [58]:
query9= """select customer.CUS_NAME , customer.CUS_GENDER from customer where customer.CUS_NAME LIKE '%A' OR customer.CUS_NAME LIKE 'A%' """
cursorobject.execute(query9)
output=cursorobject.fetchall()
output_df=pd.DataFrame(output,columns=["CUS_NAME","CUS_GENDER"])
output_df

  CUS_NAME CUS_GENDER
0   AAKASH          M
1     AMAN          M
2     NEHA          F
3    MEGHA          F

Q10) Display the total order amount of the male customers

In [61]:
query10=""" select sum(orders.ORD_AMOUNT) 
            from orders inner join customer on orders.CUS_ID=customer.CUS_ID where customer.CUS_GENDER='M' """
cursorobject.execute(query10)
output=cursorobject.fetchall()
print("Amount is=",output)

Amount is= [(Decimal('34500'),)]

In [62]:
Q11) Display all the Customers left outer join with  the orders

'C:\\Users\\santh'

In [68]:
query11="""select  *  from customer  left outer join  orders on customer.CUS_ID=orders.CUS_ID"""
cursorobject.execute(query11)
output=cursorobject.fetchall()
output_df=pd.DataFrame(output,columns=["CUS_ID","CUS_NAME","CUS_PHONE","CUS_CITY","CUS_GENDER","ORD_ID","ORD_AMOUNT","ORD_DATE","CUS_ID","PROD_ID"])
output_df

,CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER,ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID
0,1,AAKASH,9999999999,DELHI,M,26,2000,2021-10-05,1,1
1,2,AMAN,9785463215,NOIDA,M,50,2000,2021-10-06,2,1
2,3,NEHA,9999999998,MUMBAI,F,20,1500,2021-10-12,3,5
3,4,MEGHA,9994562399,KOLKATA,F,30,3500,2021-08-16,4,3
4,5,PULKIT,7895999999,LUCKNOW,M,25,30500,2021-09-16,5,2